Revit 2027 API
ExportIFCCategoryKey.SubCategoryName Property
 The Revit subcategrory name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SubCategoryName { get; set; }
Public Property SubCategoryName As String
	Get
	Set
public:
property String^ SubCategoryName {
	String^ get ();
	void set (String^ value);
}
member SubCategoryName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportIFCCategoryKey Class
Autodesk.Revit.DB Namespace